import json

# 对比的指数ETF代码
compare_index = ["510310", "510580"]  #沪深300，中证500

# 2022/1/18：米国通胀数据非常夸张，为防范未来风险，权益类基金今日减仓1%
# 2022/2/5：未来保持谨慎调仓。将新挖掘基金纳入基金池。
# 2022/2/9： 对风格偏移基金进行仓位调整。


# 权益类基金代码
fund = [
        #-----------    观察区     -----------
        "011230",  #创金数字经济C    0.4%
        "001667",  #中加转型A  
        "009206",  #兴银丰运C
        "000006",  #西部量化A        3%
        "320018",  #诺安新动力       
        "001667",  #南方转型A
        "008222",  #兴业机遇         0.0%         
        #-----------   高风险      -----------
        "008777",  #沪深300          3% 
        "519702",  #交银趋势优先A     6%
        "001508",  #富国新动力A      5.9%
        "003962",  #易方达瑞程C      5.6% 
        "002340",  #富国价值优势     5.1%
        "001445",  #华安国企改革     4.7%
        "001366",  #金鹰产业整合     3.6%
        "010728",  #中泰兴诚一年     0.8%
        "001043",  #工银美丽城镇A    2.5%
        "009707",  #工银新兴制造A    2.5%
        "001305",  #九泰天富A        2.5% 
        "161834",  #银华鑫锐A        2.3%
        "163409",  #兴全绿色         1.6%
        "550015",  #中信至远A        1.3%
        #-----------    中风险    -----------
        "007509",   #华商润丰C       3.9%
        "519613",   #银河君尚        
        "004932",   #招商丰拓A       2.5%
        "004206",   #华商元亨        0.0%
        #-----------   美股指数   -----------
        "040046",  #华安纳斯达克100  7.5%
        "050025",  #博时标普500      7.2%
]
# 仅监控基金经理是否更改，适合低风险偏债券基金
fund_extra = [
    "003547",   #鹏华丰禄     2.5%
    "003859",   #招商昭旭A    3%
    "002704",   #德邦锐兴A    3%
    "006966",   #财通安瑞C    
    "007744",   #长盛安逸A    2.5%
    "000914",   #中加纯债
    "004127",   #鹏华丰康
    "003429",   #兴业高级债指
    #----------- 上纯债，下固收+ -----------
    "001182",   #易方达安心  
    "519769",   #交银优选C    2.5%
    "002742",   #泓德裕祥A   
    "008356",   #中加科丰
    "002087",   #国富新机遇A  2.5%
    "002144",   #华安新优选C  
    "004010",   #华泰鼎利 
    "164105",   #华富强化债
    "002794",   #天弘永利E
    "210010",   #金鹰灵活A    
    "013260",   #太平睿享A
]
# 香港基金，暂不支持
fund_hk = [
    "968075",  #百达策略收益
    "968010"   #摩根太平洋    6.7%
]


def get_funds():
    return {'compare_index': compare_index, 'fund': fund, 'fund_extra': fund_extra}


if __name__ == '__main__':
    with open('data/fund_codes.json', 'w', encoding='utf-8') as fin:
        json.dump(list(set(compare_index + fund + fund_extra)), fin)
