import json

# 对比的指数ETF代码
compare_index = ["510310", "510580", "000914"]  #沪深300，中证500，中加纯债


# 2022/2/16： 调仓，维持“多数A股股票不具备长期价值投资”的观点，对实际操作策略为“长期持有”、和规模持续变大的基金减持。限于时间精力，未来将减少权益类基金追踪的数量。
# 2022/3/3：  调仓，减配反弹的赛道股，增持低估值风格基金。
# 2022/3/11：  调仓，对规模过大的基金进行调整。

# 权益类基金代码
fund = [
        #-----------   观察区     -----------
        "011230",  #创金数字经济C    2.1% 
        "008222",  #兴业机遇C        0.0%      
        "003962",  #易方达瑞程C      3.2%    
        "110012",  #易方达科汇       0.3%
        #-----------   高风险      -----------
        "008777",  #沪深300          7% 
        "519702",  #交银趋势优先A     6%
        "001508",  #富国新动力A      5.9%
        "001445",  #华安国企改革     4.7%
        "001366",  #金鹰产业整合     3.6%
        "010728",  #中泰兴诚一年     0.8%
        "001043",  #工银美丽城镇A    2.6%
        "005775",  #中加转型A        2.3%
        "002036",  #安信优势C        2.3%
        "001305",  #九泰天富A        2% 
        "320018",  #诺安新动力       2.3%
        "161834",  #银华鑫锐A        2.3%
        "163409",  #兴全绿色         1.6%
        #-----------    中风险    -----------
        "007509",  #华商润丰C        3.9%
        "009206",  #兴银丰运C
        "519613",  #银河君尚        
        "004932",  #招商丰拓A        2.5%
        #-----------   美股指数   -----------
        "040046",  #华安纳斯达克100  7.5%
        "050025",  #博时标普500      7.2%
        #-----------   二号组合   -----------
        "002445",  #兴业丰泰     
        "002820",  #招商丰美C    
        "003235",  #信诚至利C    
        "002729",  #华富益鑫C    
        "009230",  #鹏华安和A     
        "002872",  #华夏智胜C        100%
        "001844",  #九泰久益C    
]
# 仅监控基金经理是否更改，适合低风险偏债券基金
fund_extra = [
    "003547",   #鹏华丰禄     2.5%
    "003859",   #招商昭旭A    3%
    "002704",   #德邦锐兴A    3%
    "006966",   #财通安瑞C    
    "007744",   #长盛安逸A    2.6%
    "000914",   #中加纯债
    "004127",   #鹏华丰康
    "003429",   #兴业信用债指
    #----------- 上纯债，下固收+ ----------- 
    "519769",   #交银优选C    2.5%
    "002087",   #国富新机遇A  2.5%
    "002144",   #华安新优选C  
    "004010",   #华泰鼎利 
    "164105",   #华富强化债    
    "001182",   #易方达安心 
    "004206",   #华商元亨        
    "008356",   #中加科丰
    "002794",   #天弘永利E
    "210010",   #金鹰灵活A    
    "013260",   #太平睿享A
]
# 香港基金，暂不支持
fund_hk = [
    "968075",  #百达策略收益
    "968010"   #摩根太平洋    6.7%
]

fund.extend(fund_extra)


def get_funds():
    return {'compare_index': compare_index, 'fund': fund, 'fund_extra': fund_extra}


if __name__ == '__main__':
    with open('data/fund_codes.json', 'w', encoding='utf-8') as fin:
        json.dump(list(set(compare_index + fund + fund_extra)), fin)
