import json

# 对比的中高风险基金
compare_index = ["510310", "510580" ]  #沪深300，中证500，

# 对比的中低风险基金
compare_index_bond = ["161119", "519769"]  #债券综指,交银固收+



# 中高风险基金代码
fund = [
        #-----------      指数型      -----------
        "012970",  #芯片半导体       2.9%
        "009329",  #消费龙头         2.7%
        "012805",  #恒生科技         5.1%
        "012323",  #中证医疗         3.7%
        "006705",  #MSCI A股        3.7%
        "008777",  #沪深300          2.4%
        #-----------      高风险      -----------
        "001508",  #富国新动力A      6.8%
        "519702",  #交银趋势优先A    5.8%
        "005775",  #中加转型A        5.2%
        "002036",  #安信优势C        5.1%
        "001043",  #工银美丽城镇A    3.4%
        "010728",  #中泰兴诚一年     2.8%
        #-----------      中风险      -----------
        "007509",  #华商润丰C        5.1%
        "001345",  #富国新收益A      5.0%
        "009206",  #兴银丰运C        3%      
        "519613",  #银河君尚         2.8%
        #-----------  全球及大宗商品  -----------
        "040046",  #美国纳斯达克100   7.1%
        "050025",  #美国标普500      7.4%
        "000216",  #黄金             0.6%
        "014982",  #全球石油                
]
# 中低风险基金代码
fund_bond = [
    #-----------      固收+     ----------- 
    "010658",   #海富通欣睿C     2.5%
    "010036",   #广发恒通A       0.0%   
    "004011",   #华泰鼎利C     
    "009078",   #红土创新C
    "002058",   #中银新机遇C
    "001422",   #景顺安享A    
    #-----------      混债      -----------
    "010092",   #永赢华嘉A     
    "240003",   #华宝宝康A  
    "164105",   #华富强化债
    "217024",   #招商安盈A     
    #-----------      纯债       -----------   
    "161119",   #债券综指A       0.7%
    "003547",   #鹏华丰禄        3.9%
    "007744",   #长盛安逸A       6.1%
    "000931",   #国寿尊益        
    "003999",   #富荣纯债        0.8%
    "000914",   #中加纯债
    "006242",   #宝盈盈润        0.4%
    "970132",   #东证融汇A
    "400030",   #东方添益
    #-----------      监控      -----------
    "003859",   #招商昭旭A       
    "002144",   #华安新优选C     
    "004206",   #华商元亨        
    "008356",   #中加科丰
    "002704",   #德邦锐兴A       
    "210010",   #金鹰灵活A
    "002087",   #国富新机遇A   
]
# 香港基金，暂不支持
fund_hk = [
    "968010"   #摩根太平洋    7.4%
]

# fund.extend(fund_bond)


def get_funds():
    return {'compare_index': compare_index, 'fund': fund}

def get_funds_bond():
    return {'compare_index': compare_index_bond, 'fund': fund_bond }

if __name__ == '__main__':
    with open('data/fund_codes.json', 'w', encoding='utf-8') as fin:
        json.dump(list(set(compare_index +compare_index_bond+ fund + fund_bond)), fin)
