import json

# 对比的中高风险基金
compare_index = ["510310", "510580" ]  #沪深300，中证500，

# 对比的中低风险基金
compare_index_bond = ["161119", "519769"]  #债券综指,交银固收+



# 中高风险基金代码
fund_index = [
        #-----------   价值指数     -----------
        "257060",  #上证大宗商品C|015577  
        "017057",  #嘉实绿电C
        "167301",  #方正富邦保险
        "012645",  #建信券商C|012646
        "005224",  #广发基建C
        "001595",  #天弘银行C
        "004642",  #南方房地产C|010989     0.4%
        "159766",  #旅游（场内）
        "004752",  #广发传媒C|004753
        #-----------   成长指数     -----------
        "010769",  #天弘农业C|010770
        "160632",  #鹏华酒C|012043
        "161028",  #嘉实新能源C|012544      
        "011103",  #天弘光伏C 
        "588080",  #易方达科创50|011609
        "005693",  #广发军工C              1.4%
        "008888",  #芯片半导体|012970      2.4%
        "162412",  #中证医疗|012323        3.1%
        "513360",  #教育（场内）
        "014425",  #博时恒生医疗C          0.4%
        "012805",  #广发恒生科技C          4.1%
        #-----------   宽基指数     -----------
        "006705",  #MSCI A股              2.1%
        "008777",  #沪深300               1.4%
        "007029",  #中证500                     
]
fund_stock = [ 
        #-----------    高风险主动    -----------
        "001508",  #富国新动力A      5.8%
        "519702",  #交银趋势优先A    5.8%
        "010728",  #中泰兴诚一年     2.8%
        #-----------    中风险主动    -----------
        "007509",  #华商润丰C        7.1%
        "001345",  #富国新收益A      3.0%
        "009206",  #兴银丰运C        3%      
        #-----------  全球及大宗商品  -----------
        "040046",  #美国纳斯达克100   9.1%
        "050025",  #美国标普500      9.4%
        "000216",  #黄金             1.6%
        "014982",  #全球石油                
]
fund = fund_index + fund_stock

# 中低风险基金代码
fund_bond = [
    #-----------      固收+     ----------- 
    "010036",   #广发恒通A       3.0%   
    "009078",   #红土创新C       1.0% 
    "002015",   #南方荣光        1.4%
    "002058",   #中银新机遇C
    "001422",   #景顺安享A    
    #-----------      混债      -----------
    "217024",   #招商安盈A     
    #-----------      纯债       -----------   
    "161119",   #债券综指A       6.1%
    "011489",   #创金双季A       1.4%
    "007744",   #长盛安逸A       5.1%
    #-----------      监控      -----------
    "004206",   #华商元亨        
    "008356",   #中加科丰
    "210010",   #金鹰灵活A
]

# fund.extend(fund_bond)

def get_funds():
    return {'compare_index': compare_index, 'fund': fund}

def get_funds_bond():
    return {'compare_index': compare_index_bond, 'fund': fund_bond }

if __name__ == '__main__':
    with open('data/fund_codes.json', 'w', encoding='utf-8') as fin:
        json.dump(list(set(compare_index +compare_index_bond+ fund + fund_bond)), fin)
